securebanking-openbanking-uk-gateway-conversion-filter/src/test/resources/domesticPaymentIntent4.json

{
  "_id": "PDC_2844f314-cce8-4607-8594-939e3a6bd2e1",
  "_rev": "000000005bb5eb99",
  "Data": {
    "ConsentId": "PDC_2844f314-cce8-4607-8594-939e3a6bd2e1",
      "CreationDateTime": "2022-09-09T13:51:17.246Z",
    "Status": "AwaitingAuthorisation",
    "StatusUpdateDateTime": "2022-09-09T13:51:17.246Z",
    "ReadRefundAccount": "Yes",
    "CutOffDateTime": null,
    "ExpectedExecutionDateTime": null,
    "ExpectedSettlementDateTime": null,
    "Charges": [
      {
        "ChargeBearer": "BorneByDebtor",
        "Type": "UK.OBIE.CHAPSOut",
        "Amount": {
          "Amount": "1.5",
          "Currency": "GBP"
        }
      }
    ],
    "Initiation": {
      "InstructionIdentification": "ACME412",
      "EndToEndIdentification": "FRESCO.21302.GFX.20",
      "LocalInstrument": null,
      "InstructedAmount": {
        "Amount": "165.88",
        "Currency": "GBP"
      },
      "DebtorAccount": null,
      "CreditorAccount": {
        "SchemeName": "UK.OBIE.SortCodeAccountNumber",
        "Identification": "08080021325698",
        "Name": "ACME Inc",
        "SecondaryIdentification": "0002"
      },
      "CreditorPostalAddress": null,
      "RemittanceInformation": {
        "Unstructured": "Internal ops code 5120101",
        "Reference": "FRESCO-101"
      },
      "SupplementaryData": null
    },
    "Authorisation": null,
    "SCASupportData": null
  },
  "Risk": {
    "PaymentContextCode": "EcommerceGoods",
    "MerchantCategoryCode": "5967",
    "MerchantCustomerIdentification": "053598653254",
    "DeliveryAddress": {
      "AddressLine": [
        "Flat 7",
        "Acacia Lodge"
      ],
      "StreetName": "Acacia Avenue",
      "BuildingNumber": "27",
      "PostCode": "GU31 2ZZ",
      "TownName": "Sparsholt",
      "CountrySubDivision": null,
      "Country": "UK"
    }
  },
  "Links": null,
  "Meta": null
}
